app/controllers/routines_controller.rb

SELECT * FROM `routines` WHERE (`routines`.`id` = 1)
---
  def show
    @routine = Routine.find(params[:id])

SELECT * FROM `routines` WHERE (`routines`.`id` = 7)
DELETE FROM `routines` WHERE `id` = 7
---
  def destroy
    @routine = Routine.find(params[:id])
    stethoscope = @routine.stethoscope
    @routine.destroy