app/controllers/stethoscopes_controller.rb

SELECT * FROM `stethoscopes`
---
  def index
    @stethoscopes = Stethoscope.all

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
---
  def show
    @stethoscope = Stethoscope.find(params[:id])

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
---
  def edit
    @stethoscope = Stethoscope.find(params[:id])

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
---
  def ping
    @stethoscope = Stethoscope.find(params[:id])

INSERT INTO `routines` (`name`, `created_at`, `updated_at`, `returned`, `status`, `stethoscope_id`) VALUES('mem_stats', '2010-07-24 05:25:19', '2010-07-24 05:25:19', '--- {}\n\n', 3, 1)
SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
UPDATE `routines` SET `returned` = '--- {}\n\n' WHERE `id` = 3
---
  def add_routine
    @routine = Routine.create(:name => params[:routine][:name], :stethoscope_id => params[:id])
    @stethoscope = Stethoscope.find(params[:id])
    respond_to do |format|
      if @routine.save

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 2)
SELECT * FROM `routines` WHERE (`routines`.stethoscope_id = 2)
INSERT INTO `routines` (`name`, `created_at`, `updated_at`, `stethoscope_id`) VALUES('mem_stats', '2010-07-26 18:33:15', '2010-07-26 18:33:15', 3)
INSERT INTO `stethoscopes` (`created_at`, `updated_at`, `server`, `description`) VALUES('2010-07-26 18:33:15', '2010-07-26 18:33:15', 'localhoweqweqs2t:4567', '')
---
  def duplicate
    @copy_me = Stethoscope.find(params[:id])
    @new_guy = Stethoscope.new(:server => @copy_me.server, :description => @copy_me.description)

    @copy_me.routines.each do |routine|
      @new_guy.routines << Routine.new(:name => routine.name, :stethoscope_id => @new_guy.id)

INSERT INTO "events" ("created_at", "updated_at", "class_id", "returned_status", "stethoscope_id", "status", "message") VALUES('2010-07-22 18:10:18', '2010-07-22 18:10:18', NULL, NULL, NULL, 1, 'Pinged Server')
INSERT INTO "stethoscopes" ("created_at", "updated_at", "server", "description") VALUES('2010-07-22 16:54:32', '2010-07-22 16:54:32', 'localhost:4567', 'aplpppl
INSERT INTO `routines` (`name`, `created_at`, `updated_at`, `returned`, `status`, `stethoscope_id`) VALUES('mem_stats', '2010-07-24 06:18:59', '2010-07-24 06:18:59', '--- {}\n\n', 3, 1)
---
  def create
    @stethoscope = Stethoscope.new(params[:stethoscope])

    #lets ping the server to make sure it all works

    %w[mem_stats hostname number_of_resque_processes processes_summary server_load cpu_usage].each do |task|
      routine = Routine.new(:name => task, :stethoscope_id => @stethoscope.id)
      routine.events << Event.new(:status => 4, :returned => {'Notice' => "server called #{@stethoscope.server} created"}, :routine_id => routine.id)
      @stethoscope.routines << routine

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
SELECT * FROM `routines` WHERE (`routines`.stethoscope_id = 2)
UPDATE "stethoscopes" SET "updated_at" = '2010-07-22 15:29:36', "description" = 'This is a server that contains the teaser' WHERE "id" = 1
---
  def update
    @stethoscope = Stethoscope.find(params[:id])

    @stethoscope.routines.each do |routine|
      routine.events << Event.new(:status => 4, :returned => {"Notice" => "server name changed to #{params[:stethoscope][:server]}"})
    end

    respond_to do |format|
      if @stethoscope.update_attributes(params[:stethoscope])

SELECT * FROM `stethoscopes` WHERE (`stethoscopes`.`id` = 1)
DELETE FROM `stethoscopes` WHERE `id` = 1
---
  def destroy
    @stethoscope = Stethoscope.find(params[:id])
    @stethoscope.destroy